In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'name': ['hadi', 'ali', 'sara', 'nahid'], 'weight': [50, 70, 60, 55]})

# Simple aggregation

In [4]:
df['weight'].mean()

58.75

In [6]:
df['weight'].min()

50

# Grouping

In [7]:
df = pd.DataFrame({'birthplace': ['Mashhad', 'Bojnord', 'Bojnord', 'Sari', 'Mashhad'], 'weight': [50, 70, 60, 55, 65]})
df

  birthplace  weight
0    Mashhad      50
1    Bojnord      70
2    Bojnord      60
3       Sari      55
4    Mashhad      65

In [8]:
df.groupby('birthplace').mean()

            weight
birthplace
Bojnord       65.0
Mashhad       57.5
Sari          55.0

In [9]:
df.groupby('birthplace')

1. We can iterate over a DataFrameGroupBy object:

In [11]:
for key, split_df in df.groupby('birthplace'):
    display(split_df)

  birthplace  weight
1    Bojnord      70
2    Bojnord      60

  birthplace  weight
0    Mashhad      50
4    Mashhad      65

  birthplace  weight
3       Sari      55

In [12]:
df = pd.DataFrame({'birthplace': ['Mashhad', 'Bojnord', 'Bojnord', 'Sari', 'Mashhad'], 'weight': [50, 70, 60, 55, 65],
                   'height': [160, 166, 157, 173, 159]})
df

  birthplace  weight  height
0    Mashhad      50     160
1    Bojnord      70     166
2    Bojnord      60     157
3       Sari      55     173
4    Mashhad      65     159

2. We can call aggregation methods on a DataFrameGroupBy object:

In [13]:
df.groupby('birthplace').mean()

            weight  height
birthplace
Bojnord       65.0   161.5
Mashhad       57.5   159.5
Sari          55.0   173.0

3. We can index a DataFrameGroupBy object:

In [14]:
# with indexing the groupby
df.groupby('birthplace')['weight'].mean()

birthplace
Bojnord    65.0
Mashhad    57.5
Sari       55.0
Name: weight, dtype: float64

In [17]:
# without indexing the groupby
df.drop('height', axis=1).groupby('birthplace').mean()

            weight
birthplace
Bojnord       65.0
Mashhad       57.5
Sari          55.0

In [20]:
# without indexing the groupby
df[['birthplace', 'weight']].groupby('birthplace').mean()

            weight
birthplace
Bojnord       65.0
Mashhad       57.5
Sari          55.0

4. We can filter a groupby object:

In [22]:
df = pd.DataFrame({'birthplace': ['Mashhad', 'Bojnord', 'Bojnord', 'Sari', 'Mashhad'], 'weight': [50, 70, 60, 55, 65],
                   'height': [160, 166, 157, 173, 159]})
df

  birthplace  weight  height
0    Mashhad      50     160
1    Bojnord      70     166
2    Bojnord      60     157
3       Sari      55     173
4    Mashhad      65     159

In [24]:
# we already know simple filtering in pandas
df[df.weight<60]

  birthplace  weight  height
0    Mashhad      50     160
3       Sari      55     173

In [25]:
# filtering a data frame based on group properties
df

  birthplace  weight  height
0    Mashhad      50     160
1    Bojnord      70     166
2    Bojnord      60     157
3       Sari      55     173
4    Mashhad      65     159

In [28]:
def func1(x):  # x is a splitted df
    return x.weight.max() < 69
    
df.groupby('birthplace').filter(func1)

  birthplace  weight  height
0    Mashhad      50     160
3       Sari      55     173
4    Mashhad      65     159

In [29]:
df.groupby('birthplace').filter(lambda x: x.weight.max() < 69)

  birthplace  weight  height
0    Mashhad      50     160
3       Sari      55     173
4    Mashhad      65     159

5. Transform on a DataFrameGroupBy object

In [32]:
df.groupby('birthplace')['weight'].transform(lambda x: x-x.mean())

0   -7.5
1    5.0
2   -5.0
3    0.0
4    7.5
Name: weight, dtype: float64

In [34]:
import seaborn as sns
df = sns.load_dataset('planets')
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [36]:
df[['method', 'distance']].groupby('method').mean()

                                  distance
method
Astrometry                       17.875000
Eclipse Timing Variations       315.360000
Imaging                          67.715937
Microlensing                   4144.000000
Orbital Brightness Modulation  1180.000000
Pulsar Timing                  1200.000000
Pulsation Timing Variations            NaN
Radial Velocity                  51.600208
Transit                         599.298080
Transit Timing Variations      1104.333333

In [37]:
df[['method', 'distance']].dropna().groupby('method').mean()

                                  distance
method
Astrometry                       17.875000
Eclipse Timing Variations       315.360000
Imaging                          67.715937
Microlensing                   4144.000000
Orbital Brightness Modulation  1180.000000
Pulsar Timing                  1200.000000
Radial Velocity                  51.600208
Transit                         599.298080
Transit Timing Variations      1104.333333

In [38]:
df[['method', 'distance', 'year']].groupby(['method', 'year']).max()

                                distance
method                    year
Astrometry                2010     14.98
                          2013     20.77
Eclipse Timing Variations 2008    130.72
                          2009       NaN
                          2010    500.00
...                                  ...
Transit                   2014   1056.00
Transit Timing Variations 2011   2119.00
                          2012    855.00
                          2013    339.00
                          2014       NaN

[69 rows x 1 columns]